{"nodes": [{"mappings": [], "important": false, "name": "Action", "description": "\"An action is a change which is brought about by a single agent, playing a role. The agent is the holder of some indended outcome of the action: an action is always intentional. The intention of the agent has usually corresponds with an expectation the intended outcome to be brought about: the agent believes in some expectation. Note that the intention might not correspond with the *actual* outcome of the action.\""}, {"mappings": [], "important": false, "name": "Creation", "description": "\"An act which results in the creation of some entity/individual\""}, {"mappings": [], "important": false, "name": "Reaction", "description": "\"A reaction is an action that is (at least) performed by an agent that has observed some other action (this is an intensional view): Action <-> Reaction\""}, {"mappings": [], "important": false, "name": "Agent", "description": "\"It is a holder for propositional attitudes\""}, {"mappings": [], "important": false, "name": "Organisation", "description": "\"An organisation is a group of other organisations or persons which acts 'as one'. An organisation can be both formal (i.e. created by law or decree) or informal.\""}, {"mappings": [], "important": false, "name": "Person", "description": "\"A person is an individual agent. Usually associated with 'human being'.\""}, {"mappings": [], "important": false, "name": "Artifact", "description": "\"A physical object created by some person to fulfill a particular purpose\""}, {"mappings": [], "important": false, "name": "Collaborative_Plan", "description": "\"A collaborative plan is a plan which is shared (and executed) between at least two agents a and b.\""}, {"mappings": [], "important": false, "name": "Transaction", "description": "\"A transaction is an exchange or interaction between at least two agents a and b. Consists of two actions A and B where a is the actor of action A and the recipient of action B, and vice versa. Usually these actions are performed concurrently, but these may also be done consequently.\""}, {"mappings": [], "important": false, "name": "Natural_Object", "description": "\"A natural object is an object not created by man.\""}, {"mappings": [], "important": false, "name": "Personal_Plan", "description": "\"A personal plan is a plan which is held (and can be executed) by at most one agent.\""}, {"mappings": [], "important": false, "name": "Plan", "description": "\"A plan is a structure of multiple other plans or actions. These can be both sequential or concurrent. Usually a plan is referred to in the context of the intention to act of some agent, however when executed the plan itself comes into effect.\""}, {"mappings": [], "important": false, "name": "Trade", "description": "\"A trade is an exchange of some things between two agents a and b. Consists of two actions A and B where a is the actor of action A and the recipient of action B, and vice versa. Usually these actions are performed concurrently, but these may also be done consequently. The ownership of the things being traded is the requirement/result pair for each action.\""}, {"mappings": [], "important": false, "name": "Mental_Object", "description": ""}, {"mappings": [], "important": false, "name": "Change", "description": ""}, {"mappings": [], "important": false, "name": "Physical_Object", "description": ""}, {"mappings": [], "important": false, "name": "Process", "description": ""}, {"mappings": [], "important": false, "name": "Speech_Act", "description": "\"A speech act (or illocutionary act) creates some propositional attitude which qualifies an expression (which by default is mediated through some medium). The actor of the speech act is the utterer of the atitude (NB cannot be expressed in OWL DL).\""}, {"mappings": [], "important": false, "name": "Argument", "description": "\"An argument is a reason that is expressed through some medium\""}, {"mappings": [], "important": false, "name": "Assertion", "description": "\"The assertion is subject to a fit between words and world, in Searle's terms. It's propositional content can be true of false. If it is inconsistent with other assertions, beliefs, observations, it may come to be considered false.\""}, {"mappings": [], "important": false, "name": "Lie", "description": "\"An assertion that is inconsistent with the beliefs of the speaker. It is *intentionally* false.\""}, {"mappings": [], "important": false, "name": "Assumption", "description": "\"proposes something that usually is the case, although there is no specific evidence that it is true in this particular case\""}, {"mappings": [], "important": false, "name": "Belief", "description": "\"Someting an agent 'believes in', i.e. holds as true\""}, {"mappings": [], "important": false, "name": "Cause", "description": "\"A cause is an epistemic role played by something which is the outcome of a (chain) of processes\""}, {"mappings": [], "important": false, "name": "Communicated_Attitude", "description": "\"A communictated attitude is a propositional attitude involved in an act of communication.\""}, {"mappings": [], "important": false, "name": "Declaration", "description": "\"Searle: the successful performance of a declaration is sufficient to bring about the fit between words and world, to make the propositional content true. In other words, if there is an inconsistency between the declaration and assertions, beliefs, or observations, it is not the declaration that is false. True of definitions and norms, and several other performative statements by legislators.\""}, {"mappings": [], "important": false, "name": "Promise", "description": "\"A promise is a communicated attitude about some future action or state\""}, {"mappings": [], "important": false, "name": "Statement_In_Writing", "description": "\"Not to be confused with the actual writing/document itself, which is the medium of the statement.\""}, {"mappings": [], "important": false, "name": "Desire", "description": "\"A feeling of wanting\""}, {"mappings": [], "important": false, "name": "Document", "description": "\"A Document bears some (and only) expression(s) stated by some statement in writing.\""}, {"mappings": [], "important": false, "name": "Evaluative_Attitude", "description": "\"An evaluative attitude expresses e.g. a judgment. The proposition qualified by the evaluative attitude is comparable to something else.\""}, {"mappings": [], "important": false, "name": "Evaluative_Proposition", "description": "\"Some thing which is evaluatively qualified, i.e. an evaluation applies to the proposition, the proposition is judged. The proposition is comparable to some other proposition.\""}, {"mappings": [], "important": false, "name": "Evidence", "description": "\"Observation and/or statement, used as a backing for a belief. Evidence is the role of observation which is qualified by some belief.\""}, {"mappings": [], "important": false, "name": "Exception", "description": "\"An exception is something that is excluded from a general statement or does not follow a rule. In LKIF rules, an exception is a rule which has an exception relation to another rule (cf. Deliverable 1.1)\""}, {"mappings": [], "important": false, "name": "Expectation", "description": "\"An expectation is a predictive belief held on purely logical grounds, i.e. not based on direct external evidence, like an observation or a statement by another agent. It is also often characterized as a \"belief about the future\", but this isn't very helpful since one may also hold expectations about the (yet unknown) past. The theory of evolution is for instance a fertile ground for predictions about the existence of past species, and therefore at the same a predictor of future observations.\""}, {"mappings": [], "important": false, "name": "Expression", "description": "\"An expression is a proposition beared by some medium, e.g. a document, and is stated by some communicated attitude\""}, {"mappings": [], "important": false, "name": "Fact", "description": "\"A fact is a proposition (about something) which is (commonly) agreed upon to hold as true: it has some backing in evidence\""}, {"mappings": [], "important": false, "name": "Intention", "description": "\"Intention is where the agent expects certain consequences of his or her actions and desires those consequences to occur. This concept must be related to qualification and preference in some way.\""}, {"mappings": [], "important": false, "name": "Medium", "description": "\"A medium is a bearer of expressions, i.e. externalised propositions. Propositions become expressions once they are externalised through some medium.\""}, {"mappings": [], "important": false, "name": "Observation", "description": "\"An observation is the role played by some proposition believed to be true or false through observation of an agent.\""}, {"mappings": [], "important": false, "name": "Problem", "description": "\"NOTE: This currently cannot be expressed: OWL DL does not support negation of properties. The definition will be further elaborated once OWL 1.1 is supported by development tools.\""}, {"mappings": [], "important": false, "name": "Surprise", "description": "\"A surprise is an observation that deviates from an expectation.\""}, {"mappings": [], "important": false, "name": "Proposition", "description": "\"NOTE: In previous versions of this ontology, this class was called 'Qualified'. In lieu of the separation between Proposition and Propositional_Attitude, the intended meaning of that class has been moved to 'Evaluative_Proposition'\""}, {"mappings": [], "important": false, "name": "Propositional_Attitude", "description": "\"A propositional attitude connects a person (the holder of the attitude) to some proposition, in fact it expresses some qualification over the proposition. Distinguishing a proposition from the propositional content expressed by it is necessary when properties relating to the thing expressed and properties of the expression itself must be distinguished. For LKIF the distinction between Belief, Intention, Qualification, and Observation is relevant. The distinction between belief/expectation, intention, and observation is relevant for i.a. establishing mens rea (guilty mind). The distinction between beliefs (expressing the content of the mind of an agent) and statements (expressing the content of an act of communication by an agent) is classical.\""}, {"mappings": [], "important": false, "name": "Qualification", "description": "\"A qualification expresses e.g. a judgment. The thing qualified by the qualification is comparable to something else.\""}, {"mappings": [], "important": false, "name": "Qualified", "description": "\"Something that is qualified by some qualification\""}, {"mappings": [], "important": false, "name": "Reason", "description": "\"Teleological counterpart of cause\""}, {"mappings": [], "important": false, "name": "Mental_Entity", "description": ""}, {"mappings": [], "important": false, "name": "Epistemic_Role", "description": ""}, {"mappings": [], "important": false, "name": "Act_of_Law", "description": "\"Act of law: a public act by a legislative body which creates an expression with legal status; the legal status depends on the jurisdiction of the legislative body.\""}, {"mappings": [], "important": false, "name": "Assignment", "description": "\"A public act that attributes a power to perform a public act to a public body.\""}, {"mappings": [], "important": false, "name": "Association", "description": "\"A voluntary association (also sometimes called an unincorporated association, or just an association) is a group of individuals who voluntarily enter into an agreement to form a body (or organization) to accomplish a purpose.\""}, {"mappings": [], "important": false, "name": "Co-operative", "description": "\"An autonomous association of persons united voluntarily to meet their common economic, social, and cultural needs and aspirations through a jointly-owned and democratically-controlled enterprise.\""}, {"mappings": ["wordnet_company_108058098"], "important": true, "name": "Company", "description": "\"A company refers to a legal entity formed which has a separate legal identity from its members, and is ordinarily incorporated to undertake commercial business. Although some jurisdictions refer to unincorporated entities as companies, in most jurisdictions the term refers only to incorporated entities. \""}, {"mappings": ["wordnet_limited_company_108185211"], "important": true, "name": "Limited_Company", "description": "\"A limited company is a corporation whose liability is limited by law\""}, {"mappings": [], "important": false, "name": "Public_Limited_Company", "description": "\"Similar to the US corporation, offers several advantages over trading as sole trader.\""}, {"mappings": ["wordnet_corporation_108059412"], "important": true, "name": "Corporation", "description": "\"A corporation is a legal entity which, while being composed of natural persons, exists completely separately from them. This separation gives the corporation unique powers which other legal entities lack. \""}, {"mappings": ["wordnet_foundation_108406486"], "important": true, "name": "Foundation", "description": "\"A kind of (philanthropic) organization, set up as a legal entity either by individuals or institutions, with the purpose of distributing grants to support causes in line with the goals of the foundation\""}, {"mappings": [], "important": false, "name": "Incorporated", "description": "\"An organisation formed into a legal corporation\""}, {"mappings": [], "important": false, "name": "Unincorporated", "description": ""}, {"mappings": [], "important": false, "name": "Decision", "description": "\"NOTE: Cannot express that the 'promised' act corresponds to the act qualified by the statement in writing\""}, {"mappings": ["wordnet_delegating_101140839"], "important": true, "name": "Delegation", "description": "\"Delegate: entrust a task or responsibility to some other person\""}, {"mappings": [], "important": false, "name": "Legal_Person", "description": "\"A legal entity is a natural person or a legal construct through which the law allows a group of natural persons to act as if it were a single composite individual for certain purposes. The most common purposes are lawsuits, property ownership, and contracts. Sometimes referred to as corporate personhood or legal personality, this concept allows for easy conduct of business by having ownership, lawsuits, and agreements under the name of the legal entity instead of the several names of the people making up the entity.\n\nA legal entity is not necessarily distinct from the natural persons of which it is composed. Most legal entities are simply amalgamations of the persons that make it up for convenience's sake. A legal entity that does have a separate existence from its members is called a company or corporation. This distinction gives the corporation its unique perpetual succession privilege and is usually also the source of the limited liability of corporate members. Some other legal entities also enjoy limited liability of members, but not on account of separate existence (Source: Wikipedia.org)\""}, {"mappings": [], "important": false, "name": "Private_Legal_Person", "description": "\"A legal person as defined in private law\""}, {"mappings": ["wordnet_court_108329453"], "important": true, "name": "Public_Body", "description": "\"A public body or body created by an act of law to serve a public interest\""}, {"mappings": ["wordnet_pleading_106559365"], "important": true, "name": "Legal_Speech_Act", "description": "\"A legal speech act creates some propositional attitude towards a legal expression.\""}, {"mappings": ["wordnet_legislature_108163273"], "important": true, "name": "Legislative_Body", "description": "\"A legislature is a type of (representative) deliberative assembly with the power to adopt laws.\""}, {"mappings": [], "important": false, "name": "Mandate", "description": "\"Mandate: give (someone) authority to act in a certain way\""}, {"mappings": [], "important": false, "name": "Natural_Person", "description": "\"A natural person is a human being perceptible through the senses and subject to physical laws, as opposed to an artificial person, i.e., an organization that the law treats for some purposes as if it were a person distinct from its members or owner.\""}, {"mappings": ["wordnet_association_108049401"], "important": true, "name": "Society", "description": "\"An organized group of people associated together for religious, benevolent, cultural, scientific, political, patriotic, or other purposes.\""}, {"mappings": [], "important": false, "name": "Public_Act", "description": "\"A public act is an act by some Person or Organisation which creates (at least) a communicated attitude (and thereby an expression)\""}, {"mappings": ["wordnet_party_110402824"], "important": true, "name": "Legal_Role", "description": "\"A legal role is a role played in a legal context. Legal role players can be both Agents and other 'things'\""}, {"mappings": [], "important": false, "name": "Social_Legal_Role", "description": "\"A social legal role is played by some agent in the context of legal activities.\""}, {"mappings": ["wordnet_judge_110225219", "wordnet_lawyer_110249950", "wordnet_judiciary_108166187"], "important": true, "name": "Professional_Legal_Role", "description": "\"A professional legal role is a legal profession of some person, examples: lawyer, judge etc.\""}, {"mappings": [], "important": false, "name": "Atom", "description": "\"An atom is the most basic (undivisible) part of an LKIF rule (cf. Deliverable 1.1)\""}, {"mappings": [], "important": false, "name": "Negated_Atom", "description": "\"A negated atom is the negation of some other atom (cf. Deliverable 1.1)\""}, {"mappings": [], "important": false, "name": "Rule", "description": "\"An LKIF rule, based on swrl:Impl\""}, {"mappings": [], "important": false, "name": "Valid_Rule", "description": "\"A valid LKIF rule\""}, {"mappings": [], "important": false, "name": "Abstract_Entity", "description": "\"An abstract concept is a concept which does not (necessarily) have a referent in either the physical or the mental world.   \n\nAbstract entities are (proto)mathematical, formal entities, entities which have a purely formal, logical or mathematical meaning.\n\nAs all concepts are abstractions, one may argue that a separate abstract world is difficult to see. In common-sense, a circle has more properties and is less abstract than in mathematics. Even mathematicians marvel about the fact their pure abstractions enable us to predict very concrete things. However, we are not directly concerned with these mappings. The most important is that common-sense knows about a (small) number of proto-mathematical concepts, such as collections, sequences and count-numbers (positive integers). We know also about geometric simplifications such as line, circle, square, cube, etc. These common sense notions might even be the real roots of our mathematics. However, these kind of semi-formal abstractions do not play a very central role in law, and therefore LRI-Core is thinly populated with abstract classes.\""}, {"mappings": [], "important": false, "name": "Occurrence", "description": "\"A consequence of our clear separation of ontology from models of situations (occurrences), is well exemplified in the two ways we look at time and space. Things happen against the canvas of space and time. This 3D canvas moving in time (or whatever metaphor) allows us to index instances of objects and processes. Time and space provide positions in time and space for objects. Positions are in general modeled in some mereological framework. However, the objects and processes as classes have time and space properties in a different way. Space occupied by an object is its inherent property of size or extension. This property was for Descartes even the critical one that separated mental (not: abstract) objects from physical ones. Processes occupy (consume) time; they take some duration. This time resource is inversely related to the consumption of energy. This distinction between position and extension is also made in various other ontologies. However, this distinction is easily obscured by the fact that the extension of an object can also be used as a reference for location. An object can be in another object. In fact, any physical object can be used as a spatial and even temporal referent. This does not refute our view that locations are occurrences. To be precise: extension is an inherent, necessary property of a physical object or process; its location is an accidental one.\""}, {"mappings": [], "important": false, "name": "Spatio_Temporal_Occurrence", "description": "\"An occurrence in space-time\""}, {"mappings": [], "important": false, "name": "Physical_Entity", "description": "\"The physical world evolves around two main classes: physical objects and processes.\n\nIn lkif-core, the physical world evolves around two main classes: physical objects and processes. Objects are pieces of matter, while matter is typed by substances. Objects have mass, extension, viz. form and aggregation state (which limits form). Objects are the specification of the notion that matter, and in particular solid objects, is what makes the physical world relatively stable and observable. We define (physical) situations in the first place by the arrangement of physical objects (entities).\""}, {"mappings": [], "important": false, "name": "Part", "description": "\"A part is a part_of some whole\""}, {"mappings": [], "important": false, "name": "Whole", "description": "\"A whole has at least some part\""}, {"mappings": [], "important": false, "name": "Composition", "description": "\"A composition has multiple parts, the components should meet\""}, {"mappings": [], "important": false, "name": "Pair", "description": "\"A composition of exactly two parts\""}, {"mappings": [], "important": false, "name": "Action_Power", "description": "\"An action-power consists in a generic power to produce a legal effect through an action determining it. Also called Subjections\""}, {"mappings": [], "important": false, "name": "Allowed", "description": "\"See normatively qualified. Alternative labels: permitted, sanctioned, let, licensed.\""}, {"mappings": [], "important": false, "name": "Allowed_And_Disallowed", "description": "\"Something which is both allowed and disallowed through some norm\""}, {"mappings": [], "important": false, "name": "Obliged", "description": "\"Is allowed by an Obligation, i.e. the alternative is strictly_worse according to the Obligation. Alternative labels: directed, commanded.\""}, {"mappings": [], "important": false, "name": "Strictly_Allowed", "description": "\"Loose end.\""}, {"mappings": [], "important": false, "name": "Belief_In_Violation", "description": "\"A belief in some violation\""}, {"mappings": [], "important": false, "name": "Code", "description": "\"A legal code bears one or more norms, all of which are uttered by some legislative body. It cannot bear expressions which are not uttered by a legislative body.\""}, {"mappings": ["wordnet_code_of_conduct_105668095"], "important": true, "name": "Code_of_Conduct", "description": "\"a code outlining the responsibilities of or best practice for an individual or organisation, such as a set of principles of good corporate behaviour adopted by a business\\\""}, {"mappings": ["wordnet_contract_106520944"], "important": true, "name": "Contract", "description": "\"A contract bears one or more norms, all of which are uttered by some natural person or legal person. It cannot bear expressions which are uttered by a different kind of agent.\""}, {"mappings": [], "important": false, "name": "Custom", "description": "\"The collective memory of some group of agents, i.e. propositions beared by custom are shared (i.e. held) by all members of the group\""}, {"mappings": [], "important": false, "name": "Customary_Law", "description": "\"In law, custom, or customary law consists of established patterns of behaviour that can be objectively verified within a particular social setting.\""}, {"mappings": [], "important": false, "name": "Declarative_Power", "description": "\"We say that j has the declarative power to realize A to mean that if j declares A, then it is legally valid that A. For example, if x has the declarative power to terminate y’s obligation toward x to do then if x declares that y’s obligation toward x finishes, then it is legally valid that this obligation finishes.\""}, {"mappings": ["wordnet_prohibition_106542047", "wordnet_decree_106539770"], "important": true, "name": "Decree", "description": "\"The word decree is often used as a derogative term for any authoritarian decision\""}, {"mappings": [], "important": false, "name": "Definitional_Expression", "description": "\"A definition in a legal context (for example “x means y” or “by x it is meant y”);\""}, {"mappings": [], "important": false, "name": "Directive", "description": "\"Examples are European Union directive, a legislative act of the European Union and Directives, used by United States Government agencies (particularly the Department of Defense) to convey policies, responsibilities, and procedures.\""}, {"mappings": [], "important": false, "name": "Disallowed", "description": "\"See Qualified. Alternative labels: violation, prohibited, forbidden\""}, {"mappings": [], "important": false, "name": "Strictly_Disallowed", "description": "\"Loose end.\""}, {"mappings": [], "important": false, "name": "Disallowed_Intention", "description": "\"The propositional content (i.e. that which is intended) of the intention is disallowed. Interesting concept for establishing mens rea (guilty mind), although 'disallowed' is a weaker qualification than criminal. Note the distinction between purposely committing a crime and knowingly committing a crime. The crime committed does not have to match the crime intended for establishing intent!\""}, {"mappings": [], "important": false, "name": "Enabling_Power", "description": "\"An enabling power is used in cases where the law aims at enabling some agent to produce an effect in a particular way.\""}, {"mappings": ["wordnet_right_113341756"], "important": true, "name": "Potestative_Right", "description": "\"A potestative right is an enabling power which is meant to benefit the holder of the power. For example, if some animal y does not \nbelong to anybody, then x has the potestative-right to start x’s ownership of the animal,  by capturing y.\""}, {"mappings": [], "important": false, "name": "Evaluative_Expression", "description": "\"A legal evaluative expression asserts that something is good or bad, is a value to be optimised or an evil to be minimised (for example “human dignity is value”, “participation ought to be promoted”);\""}, {"mappings": [], "important": false, "name": "Exclusionary_Right", "description": "\"An exclusionary right concerns the prohibition against performing certain inferences (against reasoning in certain ways), or \nagainst using certain kinds of premises for certain purposes, in the interest of a particular person. This is especially the case with anti-discrimination rules.\""}, {"mappings": [], "important": false, "name": "Existential_Expression", "description": "\"Establishes or terminates the existence of a legal entity (for example “the company ceases to exist”);\""}, {"mappings": [], "important": false, "name": "Hohfeldian_Power", "description": "\"A hohfeldian power covers any action which determines a legal effect.\""}, {"mappings": ["wordnet_exemption_100213903"], "important": true, "name": "Immunity", "description": "\"Also called Disabilities\""}, {"mappings": [], "important": false, "name": "International_Agreement", "description": "\"An agreement entered into by actors in international law, namely states and international organizations. \""}, {"mappings": [], "important": false, "name": "Non-binding_International_Agreement", "description": "\"Some international agreement that is not binding under international law\""}, {"mappings": [], "important": false, "name": "Resolution", "description": "\"A resolution is a written motion adopted by a deliberative body. The substance of the resolution can be anything that can normally be proposed as a motion.\""}, {"mappings": ["wordnet_treaty_106773434"], "important": true, "name": "Treaty", "description": "\"A treaty is a binding agreement under international law entered into by actors in international law, namely states and international organizations. Treaties are called by several names: treaties, international agreements, protocols, covenants, conventions, exchanges of letters, exchanges of notes, etc.\""}, {"mappings": [], "important": false, "name": "International_Arbitration", "description": "\"International Arbitration is the established method today for resolving disputes between parties to international commercial agreements. As with arbitration generally, it is a creature of contract, i.e., the parties' decision to submit any disputes to private adjudication by one or more arbitrators appointed in accordance with rules the parties themselves have agreed to adopt, usually by including a provision for the same in their contract. The practice of international arbitration has developed so as to allow parties from different legal and cultural backgrounds to resolve their disputes, generally without the formalities of their underlying legal systems.\""}, {"mappings": ["wordnet_common_law_108453722", "wordnet_case_law_106535035"], "important": true, "name": "Legal_Doctrine", "description": "\"Legal doctrine is a framework, set of rules, procedural steps, or test, often established through precedent in the common law, through which judgments can be determined in a given legal cas\""}, {"mappings": ["wordnet_written_agreement_106771653", "wordnet_criminal_record_106490173", "wordnet_mandate_106556481", "wordnet_legal_document_106479665"], "important": true, "name": "Legal_Document", "description": "\"A legal document is a document bearing norms or normative statements. By virtue of this definition the norm-as-propositional-attitude is reified as norm-as proposition. In other words, the norm being expressed through the legal source is an expression of the propositional attitude.\""}, {"mappings": ["wordnet_law_106532330", "wordnet_legal_code_106667792", "wordnet_legislation_106535222", "wordnet_law_108441203"], "important": true, "name": "Regulation", "description": "\"A regulation bears one or more norms, all of which are uttered by some legislative body. It cannot bear expressions which are not uttered by a legislative body.\""}, {"mappings": ["wordnet_legislative_act_106564387"], "important": true, "name": "Statute", "description": "\"A statute bears one or more norms, all of which are uttered by some legal person. It cannot bear expressions which are uttered by a different kind of agent.\""}, {"mappings": [], "important": false, "name": "Legal_Expression", "description": "\"Legal expressions are created by  some legal speech act and qualified by a communicated attitude\""}, {"mappings": [], "important": false, "name": "Potestative_Expression", "description": "\"Attributes a power to some agent (for example “a worker has the power to terminate his work contract”);\""}, {"mappings": [], "important": false, "name": "Qualificatory_Expression", "description": "\"Ascribes a legal role to a person or an object (for example,  “x is a citizen”, “x is an intellectual work”, “x is a technical invention”);\""}, {"mappings": [], "important": false, "name": "Legal_Source", "description": "\"A legal source is a source for legal statements, both norms and legal expressions. In a sense it is literally a 'source' of law\""}, {"mappings": [], "important": false, "name": "Precedent", "description": "\"In law, a precedent or authority is a legal case establishing a principle or rule that a court may need to adopt when deciding subsequent cases with similar issues or facts. The term may also refer to the collective body of case law that a court should consider when interpreting the law. When a precedent establishes an important legal principle, or represents new or changed law on a particular issue, that precedent is often known as a landmark decision.\""}, {"mappings": ["wordnet_proclamation_101266491"], "important": true, "name": "Proclamation", "description": "\"A proclamation (Lat. proclamare, to make public by announcement) is an official declaration.\""}, {"mappings": [], "important": false, "name": "Soft_Law", "description": "\"The term \"soft law\" refers to quasi-legal instruments which do not have any binding force, or whose binding force is somewhat \"weaker\" than the binding force of traditional law, often referred to as \"hard law\", in this context. The term \"soft law\" initially appeared in the area of international law, but more recently it has been transferred to other branches of law.\""}, {"mappings": ["wordnet_indebtedness_114490319"], "important": true, "name": "Liability_Right", "description": "\"A liability right expresses some right to act that brings with it some liability to perform another (compensating) act. For instance, if some k performs the permitted action A, then k will have to perform another action B for the benefit of j.\""}, {"mappings": ["wordnet_privilege_105179567", "wordnet_liberty_113996061", "wordnet_prerogative_105178715", "wordnet_civil_liberty_113995662", "wordnet_privilege_105158296", "wordnet_liberty_113994456"], "important": true, "name": "Liberty_Right", "description": "\"When, for the benefit of a person, this person is both permitted to perform and to omit an action – that is, when the action is facultative – we can say that he or she has a liberty right with regard to that action.\""}, {"mappings": [], "important": false, "name": "Mandatory_Precedent", "description": "\"In law, a binding precedent (also mandatory precedent or binding authority) is a precedent which must be followed by all lower courts. It is usually created by the decision of a higher court, such as the House of Lords in the United Kingdom. Binding precedent relies on the legal principle of stare decisis.\""}, {"mappings": [], "important": false, "name": "Norm", "description": "\"A norm is a kind of Qualification. A qualification which normatively qualifies some thing (i.e. some normatively qualified): i.e. a qualification which allows or disallows some thing.\""}, {"mappings": ["wordnet_permission_106689297"], "important": true, "name": "Permission", "description": "\"Permission allows propositions, to which therefore the predication Allowed applies. The thing(s) allowed is/are a subset of the thing(s) qualified by the permission. If S then P(A) means that S is qualified and S and A is allowed.\""}, {"mappings": ["wordnet_right_104850341", "wordnet_right_105174653"], "important": true, "name": "Right", "description": "\"A right is the legal or moral entitlement to do or refrain from doing something or to obtain or refrain from obtaining an action, thing or recogition in civil society.\""}, {"mappings": [], "important": false, "name": "Normatively_Qualified", "description": "\"Some thing which is qualified (allowed, disallowed) by a norm, i.e. a norm applies to the thing. Taking the principle of deontic choice to mean that the utterer of a normative statement intends to influence choices made by the addressee of the statement, the qualified thing should is comparable to some alternative. Note that Qualified does not partition into Allowed and Disallowed. Firstly, things can be Allowed by one Norm and Disallowed by another one. Secondly, the logical complement of the thing allowed by a permission is qualified (as worse or equal than the thing allowed), but neither allowed nor disallowed.\""}, {"mappings": ["wordnet_obligation_106773150/"], "important": true, "name": "Obligation", "description": "\"See prohibition\""}, {"mappings": [], "important": false, "name": "Obligative_Right", "description": "\"Directed obligative ought-to-do are also called obligative rights. k has the obligative  right that j does A iff it is obligatory, toward k, that j does A. An example of obligative  right is “it is obligatory, toward Mary, that Tom pays 1,000 euro to John”\""}, {"mappings": [], "important": false, "name": "Observation_of_Violation", "description": "\"An observation of a violation, i.e. of something that is Disallowed.\""}, {"mappings": ["wordnet_prohibition_106542047", "wordnet_ban_107255401", "wordnet_interdiction_107255299"], "important": true, "name": "Prohibition", "description": "\"Prohibition obliges/allows thing(s), to which therefore the predication Obliged applies, and disallows thing(s), to which therefore the predication Disallowed applies. The union of the thing(s) allowed and the thing(s) disallowed is qualified by the prohibition. The things allowed and disallowed by the prohibition are disjoint (and completely partition the space of things qualified). If S then O(A) means that S is qualified, S and A is obliged/allowed, and S and not A is disallowed. If S then F(A) means that S is qualified, S and A is disallowed, and S and not A is obliged/allowed. The difference between Obligation and Prohibition is in which part of the partition of the qualified space is explicitly described by the normative statement. Alternative label: directive\""}, {"mappings": ["wordnet_authorization_101138670"], "important": true, "name": "Permissive_Right", "description": "\"The  negation of a directed obligation is a directed permission. However, it counts as a right,  namely, a permissive right, only when such negation is aimed at benefitting the author of  the permitted action. \""}, {"mappings": [], "important": false, "name": "Persuasive_Precedent", "description": "\"In law, a persuasive precedent or advisory precedent is a precedent that need not be followed under the legal principle of stare decisis, but is nevertheless followed. Sources of persuasive precedent include the obiter dicta in the judgment of a court whose judgment would otherwise be binding, and the judgments of courts in other jurisdictions where the facts and/or legal system are similar to the case at hand. If a superior court adopts a persuasive precedent, it may become binding in the jurisdiction.\""}, {"mappings": [], "important": false, "name": "Mental_Process", "description": "\"A mental, i.e. non-physical, process that has no physical effects. Examples are (human) thought and reasoning.\""}, {"mappings": [], "important": false, "name": "Physical_Process", "description": ""}, {"mappings": [], "important": false, "name": "Continuation", "description": "\"The continuation of a change, once initiated\""}, {"mappings": [], "important": false, "name": "Initiation", "description": "\"The initation of a change\""}, {"mappings": [], "important": false, "name": "Termination", "description": "\"The termination of a change.\""}, {"mappings": [], "important": false, "name": "Temporal_Occurrence", "description": ""}, {"mappings": [], "important": false, "name": "Place", "description": "\"A place is a spatio-temporal-occurrence\""}, {"mappings": [], "important": false, "name": "Absolute_Place", "description": "\"An absolute place is defined without reference to other places.\""}, {"mappings": [], "important": false, "name": "Comprehensive_Place", "description": "\"A place is comprehensive if it always covers every place (and thus also every location-complex) and every object.\""}, {"mappings": [], "important": false, "name": "Location_Complex", "description": "\"A location complex only overlaps its own parts (OWL 1.1)\""}, {"mappings": [], "important": false, "name": "Relative_Place", "description": "\"A relative place is defined by some reference to some object/thing\""}, {"mappings": [], "important": false, "name": "Subjective_Entity", "description": "\"A subjective entity is ontologically subjective, i.e. its existence is relative to an observer, that attributes its properties to some other entity, given a context.  \""}, {"mappings": [], "important": false, "name": "Function", "description": "\"The use or purpose of some object as used in some context.\""}, {"mappings": [], "important": false, "name": "Organisation_Role", "description": "\"A role which has a meaning in the context of an organisation: i.e. the role defines a 'position' within sthe structure of roles within an organisation\""}, {"mappings": [], "important": false, "name": "Person_Role", "description": "\"A role played by some person (i.e. not an organisation)\""}, {"mappings": [], "important": false, "name": "Role", "description": "\"A role is a specification of default behavior and accompanying expectations of the thing 'playing' the role. Similar to actors in a theater who play roles, but are not the roles. Example: student.\""}, {"mappings": [], "important": false, "name": "Social_Role", "description": "\"played_by all (action:Agent and (action:actor_in some (action:Action and (plays some expression:Expectation))))\""}, {"mappings": [], "important": false, "name": "Annulment", "description": ""}, {"mappings": [], "important": false, "name": "Application", "description": "\"When a local act applies in the local legal system normative supra-ordered such as when a region applies an EU directive or a decree it applies the normative contant in some act\""}, {"mappings": [], "important": false, "name": "Application_Date", "description": "\"The date when a modification is applied to the destination legislative document. The date can be instantaneous, in the future or in the past. Normally this date coincides with the date of efficacy of the text in which the modification takes place.\""}, {"mappings": [], "important": false, "name": "Application_Interval", "description": "\"This is the interval during which a normative document, or fragment, produces the consequences that the normative provision establishes.\""}, {"mappings": [], "important": false, "name": "Delivery_Date", "description": "\"The date when the competent authorities finalise the document by affixing their signatures to it (e.g. promulgation by the president, signature by the queen etc.) This is the date shown on the document itself: it is an objective element and clearly identifyable.\""}, {"mappings": [], "important": false, "name": "Deregulation", "description": "\"When a part of some primary legislative source is delegated to some secondary legislative source (e.g. from act to regulation). \""}, {"mappings": [], "important": false, "name": "Dynamic_Temporal_Entity", "description": "\"A dynamic temporal entity represents the norm in its evolution over time.\""}, {"mappings": [], "important": false, "name": "Efficacy_Interval", "description": "\"The period during which a normative fragment may be either operative or inoperative, by explicit provision of the document itself. The document is said to be in a period of operation, or enforceability or efficacy, when it may or must be applied or enforced.\""}, {"mappings": [], "important": false, "name": "In_Force_Interval", "description": "\"The period during which a normative fragment belongs to the normative system. The period of force for each fragment may change over time as a function of the modifications the document goes through.\""}, {"mappings": [], "important": false, "name": "Efficacy_Modification", "description": "\"Modifies the efficacy period of some norm\""}, {"mappings": [], "important": false, "name": "End_efficacy", "description": ""}, {"mappings": [], "important": false, "name": "Prorogation_Efficacy", "description": "\"Prorogation of entry into force, but applied to the efficacy of some norm\""}, {"mappings": [], "important": false, "name": "Retroactivity", "description": "\"When the efficacy or a partial efficacy starts before the entry into force of the document\""}, {"mappings": [], "important": false, "name": "Start_Efficacy", "description": ""}, {"mappings": [], "important": false, "name": "Suspension", "description": "\"When a part of an act or some provisions are suspended in coming to be operative for a period or indefinately\""}, {"mappings": [], "important": false, "name": "Ultractivity", "description": ""}, {"mappings": [], "important": false, "name": "End_in_Force", "description": "\"When an act states the end of the period of enactment, and includes an implicit repealing of the text.\""}, {"mappings": [], "important": false, "name": "Enter_in_Force_Date", "description": "\"The date when a dnormative document becomes law and enters the legal system for the first time. This is the moment in the doucment's history starting from which the document can be amended, its applicability assessed, and its manner of producing an effect determined.\""}, {"mappings": [], "important": false, "name": "Existence_Date", "description": "\"The date when the formal act by which a legislative body freezes the document into its final form, it is the time when the document can be said to have begun its existence.\""}, {"mappings": [], "important": false, "name": "Extension", "description": "\"Extends the scope of normative content to some particular jurisdiction\""}, {"mappings": [], "important": false, "name": "In_Force_Modification", "description": "\"Modifies the period of being in force of some norm\""}, {"mappings": [], "important": false, "name": "Prorogation_in_Force", "description": "\"Prorogation of the date of enactment of some normative content. The 'life' of the act is lengthened with respect to some previous end of enactment modification.\""}, {"mappings": [], "important": false, "name": "Renewal", "description": ""}, {"mappings": [], "important": false, "name": "Start_in_Force", "description": ""}, {"mappings": [], "important": false, "name": "Integration", "description": ""}, {"mappings": [], "important": false, "name": "Interpretation", "description": "\"Modification of the interpretation of normative content by the author or some superior actor\""}, {"mappings": [], "important": false, "name": "Modification", "description": "\"See ESTRELLA deliverable 3.2\""}, {"mappings": [], "important": false, "name": "Semantic_Annotation", "description": "\"See ESTRELLA deliverable 3.2\""}, {"mappings": [], "important": false, "name": "Temporal_Modification", "description": "\"Modifies the efficacy or being in force of some norm\""}, {"mappings": [], "important": false, "name": "Textual_Modification", "description": "\"See ESTRELLA deliverable 3.2\""}, {"mappings": [], "important": false, "name": "Modification_of_Meaning", "description": "\"A modification that changes the meaning of some provision without changing its literal text\""}, {"mappings": [], "important": false, "name": "Modification_of_Term", "description": "\"Modification of the term specified by some procedural deadline.\""}, {"mappings": [], "important": false, "name": "Variation", "description": "\"Modification by paraphrasing\""}, {"mappings": [], "important": false, "name": "Modification_of_Scope", "description": "\"See ESTRELLA deliverable 3.2\""}, {"mappings": [], "important": false, "name": "Modification_of_System", "description": "\"See ESTRELLA deliverable 3.2\""}, {"mappings": [], "important": false, "name": "Ratification", "description": "\"When an international treaty is ratified by local parliament in order to include it in the local legal system. The same thing happens when each local parliament ratifies bilateral or multilateral agreements.\""}, {"mappings": [], "important": false, "name": "Remaking", "description": "\"When an act is completely rewritten in a new way but the topic remains the same.\""}, {"mappings": [], "important": false, "name": "Transposition", "description": "\"Interpretation in context of the European Union\""}, {"mappings": [], "important": false, "name": "Publication_Date", "description": "\"The date when the normative document is published in the official journal designated as the source for making all such documents public and legal.\""}, {"mappings": [], "important": false, "name": "Relocation", "description": "\"Moving some part of the text to some other place within the same document\""}, {"mappings": [], "important": false, "name": "Repeal", "description": "\"Removal of some part of text or the entire act from the legal system.\""}, {"mappings": [], "important": false, "name": "Static_Temporal_Entity", "description": "\"A static temporal entity captures a single moment in the norm's life that is fixed over time.\""}, {"mappings": [], "important": false, "name": "Substitution", "description": "\"Substitution of a part or entire act or annex\""}, {"mappings": [], "important": false, "name": "Moment", "description": "\"A moment is an atomic period of time, i.e. it cannot be divided into other parts\""}, {"mappings": [], "important": false, "name": "Interval", "description": "\"An interval is a composition of multiple periods of time.\""}, {"mappings": [], "important": false, "name": "Pair_Of_Periods", "description": "\"A pair of two time periods\""}], "links": [{"source": 0, "type": "lkif", "target": 1, "isImportant": true}, {"source": 0, "type": "lkif", "target": 2, "isImportant": true}, {"source": 3, "type": "lkif", "target": 4, "isImportant": true}, {"source": 3, "type": "lkif", "target": 5, "isImportant": true}, {"source": 7, "type": "lkif", "target": 8, "isImportant": true}, {"source": 9, "type": "lkif", "target": 5, "isImportant": true}, {"source": 11, "type": "lkif", "target": 7, "isImportant": true}, {"source": 11, "type": "lkif", "target": 10, "isImportant": true}, {"source": 8, "type": "lkif", "target": 12, "isImportant": true}, {"source": 13, "type": "lkif", "target": 11, "isImportant": true}, {"source": 15, "type": "lkif", "target": 6, "isImportant": true}, {"source": 15, "type": "lkif", "target": 9, "isImportant": true}, {"source": 16, "type": "lkif", "target": 0, "isImportant": true}, {"source": 1, "type": "lkif", "target": 17, "isImportant": true}, {"source": 19, "type": "lkif", "target": 20, "isImportant": true}, {"source": 24, "type": "lkif", "target": 19, "isImportant": true}, {"source": 24, "type": "lkif", "target": 25, "isImportant": true}, {"source": 24, "type": "lkif", "target": 26, "isImportant": true}, {"source": 24, "type": "lkif", "target": 27, "isImportant": true}, {"source": 38, "type": "lkif", "target": 29, "isImportant": true}, {"source": 39, "type": "lkif", "target": 40, "isImportant": true}, {"source": 39, "type": "lkif", "target": 41, "isImportant": true}, {"source": 42, "type": "lkif", "target": 31, "isImportant": true}, {"source": 42, "type": "lkif", "target": 35, "isImportant": true}, {"source": 43, "type": "lkif", "target": 22, "isImportant": true}, {"source": 43, "type": "lkif", "target": 24, "isImportant": true}, {"source": 43, "type": "lkif", "target": 28, "isImportant": true}, {"source": 43, "type": "lkif", "target": 30, "isImportant": true}, {"source": 43, "type": "lkif", "target": 37, "isImportant": true}, {"source": 46, "type": "lkif", "target": 18, "isImportant": true}, {"source": 13, "type": "lkif", "target": 42, "isImportant": true}, {"source": 13, "type": "lkif", "target": 43, "isImportant": true}, {"source": 13, "type": "lkif", "target": 44, "isImportant": true}, {"source": 48, "type": "lkif", "target": 21, "isImportant": true}, {"source": 48, "type": "lkif", "target": 23, "isImportant": true}, {"source": 48, "type": "lkif", "target": 32, "isImportant": true}, {"source": 48, "type": "lkif", "target": 33, "isImportant": true}, {"source": 48, "type": "lkif", "target": 34, "isImportant": true}, {"source": 48, "type": "lkif", "target": 36, "isImportant": true}, {"source": 48, "type": "lkif", "target": 39, "isImportant": true}, {"source": 48, "type": "lkif", "target": 46, "isImportant": true}, {"source": 53, "type": "lkif", "target": 54, "isImportant": true}, {"source": 53, "type": "lkif", "target": 55, "isImportant": true}, {"source": 56, "type": "lkif", "target": 57, "isImportant": true}, {"source": 56, "type": "lkif", "target": 58, "isImportant": true}, {"source": 56, "type": "lkif", "target": 59, "isImportant": true}, {"source": 62, "type": "lkif", "target": 63, "isImportant": true}, {"source": 62, "type": "lkif", "target": 64, "isImportant": true}, {"source": 65, "type": "lkif", "target": 49, "isImportant": true}, {"source": 65, "type": "lkif", "target": 50, "isImportant": true}, {"source": 65, "type": "lkif", "target": 60, "isImportant": true}, {"source": 65, "type": "lkif", "target": 61, "isImportant": true}, {"source": 63, "type": "lkif", "target": 51, "isImportant": true}, {"source": 63, "type": "lkif", "target": 53, "isImportant": true}, {"source": 63, "type": "lkif", "target": 56, "isImportant": true}, {"source": 63, "type": "lkif", "target": 69, "isImportant": true}, {"source": 70, "type": "lkif", "target": 49, "isImportant": true}, {"source": 70, "type": "lkif", "target": 50, "isImportant": true}, {"source": 70, "type": "lkif", "target": 61, "isImportant": true}, {"source": 70, "type": "lkif", "target": 67, "isImportant": true}, {"source": 64, "type": "lkif", "target": 66, "isImportant": true}, {"source": 69, "type": "lkif", "target": 52, "isImportant": true}, {"source": 71, "type": "lkif", "target": 72, "isImportant": true}, {"source": 72, "type": "lkif", "target": 73, "isImportant": true}, {"source": 74, "type": "lkif", "target": 21, "isImportant": true}, {"source": 74, "type": "lkif", "target": 33, "isImportant": true}, {"source": 76, "type": "lkif", "target": 18, "isImportant": true}, {"source": 76, "type": "lkif", "target": 77, "isImportant": true}, {"source": 47, "type": "lkif", "target": 13, "isImportant": true}, {"source": 79, "type": "lkif", "target": 80, "isImportant": true}, {"source": 78, "type": "lkif", "target": 74, "isImportant": true}, {"source": 78, "type": "lkif", "target": 82, "isImportant": true}, {"source": 78, "type": "lkif", "target": 83, "isImportant": true}, {"source": 84, "type": "lkif", "target": 85, "isImportant": true}, {"source": 83, "type": "lkif", "target": 84, "isImportant": true}, {"source": 87, "type": "lkif", "target": 88, "isImportant": true}, {"source": 87, "type": "lkif", "target": 89, "isImportant": true}, {"source": 87, "type": "lkif", "target": 90, "isImportant": true}, {"source": 95, "type": "lkif", "target": 96, "isImportant": true}, {"source": 101, "type": "lkif", "target": 88, "isImportant": true}, {"source": 101, "type": "lkif", "target": 102, "isImportant": true}, {"source": 104, "type": "lkif", "target": 105, "isImportant": true}, {"source": 109, "type": "lkif", "target": 86, "isImportant": true}, {"source": 109, "type": "lkif", "target": 110, "isImportant": true}, {"source": 111, "type": "lkif", "target": 112, "isImportant": true}, {"source": 111, "type": "lkif", "target": 113, "isImportant": true}, {"source": 111, "type": "lkif", "target": 114, "isImportant": true}, {"source": 117, "type": "lkif", "target": 92, "isImportant": true}, {"source": 117, "type": "lkif", "target": 93, "isImportant": true}, {"source": 117, "type": "lkif", "target": 94, "isImportant": true}, {"source": 117, "type": "lkif", "target": 98, "isImportant": true}, {"source": 117, "type": "lkif", "target": 100, "isImportant": true}, {"source": 117, "type": "lkif", "target": 118, "isImportant": true}, {"source": 117, "type": "lkif", "target": 119, "isImportant": true}, {"source": 117, "type": "lkif", "target": 114, "isImportant": true}, {"source": 120, "type": "lkif", "target": 99, "isImportant": true}, {"source": 120, "type": "lkif", "target": 106, "isImportant": true}, {"source": 120, "type": "lkif", "target": 108, "isImportant": true}, {"source": 120, "type": "lkif", "target": 121, "isImportant": true}, {"source": 120, "type": "lkif", "target": 122, "isImportant": true}, {"source": 123, "type": "lkif", "target": 96, "isImportant": true}, {"source": 123, "type": "lkif", "target": 111, "isImportant": true}, {"source": 123, "type": "lkif", "target": 116, "isImportant": true}, {"source": 123, "type": "lkif", "target": 117, "isImportant": true}, {"source": 123, "type": "lkif", "target": 124, "isImportant": true}, {"source": 123, "type": "lkif", "target": 125, "isImportant": true}, {"source": 123, "type": "lkif", "target": 126, "isImportant": true}, {"source": 130, "type": "lkif", "target": 131, "isImportant": true}, {"source": 130, "type": "lkif", "target": 132, "isImportant": true}, {"source": 133, "type": "lkif", "target": 87, "isImportant": true}, {"source": 133, "type": "lkif", "target": 101, "isImportant": true}, {"source": 135, "type": "lkif", "target": 107, "isImportant": true}, {"source": 131, "type": "lkif", "target": 134, "isImportant": true}, {"source": 131, "type": "lkif", "target": 137, "isImportant": true}, {"source": 121, "type": "lkif", "target": 97, "isImportant": true}, {"source": 121, "type": "lkif", "target": 104, "isImportant": true}, {"source": 121, "type": "lkif", "target": 109, "isImportant": true}, {"source": 124, "type": "lkif", "target": 129, "isImportant": true}, {"source": 124, "type": "lkif", "target": 139, "isImportant": true}, {"source": 125, "type": "lkif", "target": 98, "isImportant": true}, {"source": 125, "type": "lkif", "target": 100, "isImportant": true}, {"source": 132, "type": "lkif", "target": 127, "isImportant": true}, {"source": 132, "type": "lkif", "target": 128, "isImportant": true}, {"source": 132, "type": "lkif", "target": 135, "isImportant": true}, {"source": 132, "type": "lkif", "target": 138, "isImportant": true}, {"source": 126, "type": "lkif", "target": 93, "isImportant": true}, {"source": 126, "type": "lkif", "target": 115, "isImportant": true}, {"source": 126, "type": "lkif", "target": 112, "isImportant": true}, {"source": 126, "type": "lkif", "target": 113, "isImportant": true}, {"source": 47, "type": "lkif", "target": 140, "isImportant": true}, {"source": 81, "type": "lkif", "target": 15, "isImportant": true}, {"source": 81, "type": "lkif", "target": 141, "isImportant": true}, {"source": 14, "type": "lkif", "target": 142, "isImportant": true}, {"source": 14, "type": "lkif", "target": 143, "isImportant": true}, {"source": 14, "type": "lkif", "target": 16, "isImportant": true}, {"source": 14, "type": "lkif", "target": 144, "isImportant": true}, {"source": 16, "type": "lkif", "target": 140, "isImportant": true}, {"source": 16, "type": "lkif", "target": 141, "isImportant": true}, {"source": 80, "type": "lkif", "target": 146, "isImportant": true}, {"source": 149, "type": "lkif", "target": 148, "isImportant": true}, {"source": 146, "type": "lkif", "target": 147, "isImportant": true}, {"source": 146, "type": "lkif", "target": 149, "isImportant": true}, {"source": 146, "type": "lkif", "target": 150, "isImportant": true}, {"source": 47, "type": "lkif", "target": 151, "isImportant": true}, {"source": 155, "type": "lkif", "target": 48, "isImportant": true}, {"source": 155, "type": "lkif", "target": 152, "isImportant": true}, {"source": 155, "type": "lkif", "target": 156, "isImportant": true}, {"source": 156, "type": "lkif", "target": 153, "isImportant": true}, {"source": 156, "type": "lkif", "target": 154, "isImportant": true}, {"source": 151, "type": "lkif", "target": 155, "isImportant": true}, {"source": 163, "type": "lkif", "target": 159, "isImportant": true}, {"source": 163, "type": "lkif", "target": 160, "isImportant": true}, {"source": 163, "type": "lkif", "target": 164, "isImportant": true}, {"source": 163, "type": "lkif", "target": 165, "isImportant": true}, {"source": 166, "type": "lkif", "target": 167, "isImportant": true}, {"source": 166, "type": "lkif", "target": 168, "isImportant": true}, {"source": 166, "type": "lkif", "target": 169, "isImportant": true}, {"source": 166, "type": "lkif", "target": 170, "isImportant": true}, {"source": 166, "type": "lkif", "target": 171, "isImportant": true}, {"source": 166, "type": "lkif", "target": 172, "isImportant": true}, {"source": 177, "type": "lkif", "target": 157, "isImportant": true}, {"source": 177, "type": "lkif", "target": 173, "isImportant": true}, {"source": 177, "type": "lkif", "target": 178, "isImportant": true}, {"source": 177, "type": "lkif", "target": 179, "isImportant": true}, {"source": 177, "type": "lkif", "target": 180, "isImportant": true}, {"source": 183, "type": "lkif", "target": 184, "isImportant": true}, {"source": 183, "type": "lkif", "target": 185, "isImportant": true}, {"source": 183, "type": "lkif", "target": 186, "isImportant": true}, {"source": 187, "type": "lkif", "target": 182, "isImportant": true}, {"source": 187, "type": "lkif", "target": 188, "isImportant": true}, {"source": 187, "type": "lkif", "target": 189, "isImportant": true}, {"source": 190, "type": "lkif", "target": 33, "isImportant": true}, {"source": 190, "type": "lkif", "target": 176, "isImportant": true}, {"source": 191, "type": "lkif", "target": 158, "isImportant": true}, {"source": 191, "type": "lkif", "target": 162, "isImportant": true}, {"source": 191, "type": "lkif", "target": 192, "isImportant": true}, {"source": 191, "type": "lkif", "target": 193, "isImportant": true}, {"source": 191, "type": "lkif", "target": 194, "isImportant": true}, {"source": 184, "type": "lkif", "target": 187, "isImportant": true}, {"source": 184, "type": "lkif", "target": 190, "isImportant": true}, {"source": 184, "type": "lkif", "target": 191, "isImportant": true}, {"source": 198, "type": "lkif", "target": 161, "isImportant": true}, {"source": 198, "type": "lkif", "target": 174, "isImportant": true}, {"source": 198, "type": "lkif", "target": 195, "isImportant": true}, {"source": 185, "type": "lkif", "target": 166, "isImportant": true}, {"source": 185, "type": "lkif", "target": 177, "isImportant": true}, {"source": 186, "type": "lkif", "target": 181, "isImportant": true}, {"source": 186, "type": "lkif", "target": 196, "isImportant": true}, {"source": 186, "type": "lkif", "target": 197, "isImportant": true}, {"source": 186, "type": "lkif", "target": 199, "isImportant": true}, {"source": 80, "type": "lkif", "target": 145, "isImportant": true}, {"source": 74, "type": "lkif", "target": 200, "isImportant": true}, {"source": 84, "type": "lkif", "target": 201, "isImportant": true}, {"source": 85, "type": "lkif", "target": 202, "isImportant": true}, {"source": 145, "type": "lkif", "target": 201, "isImportant": true}, {"source": 145, "type": "lkif", "target": 200, "isImportant": true}]}